# InvalidRebarHostFamilyCanHostRebarParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..InvalidRebarHostFamilyCanHostRebarParam Property
BuiltInFailures..::..RebarFailures Class See Also
---
Rebar can't be placed in this Generic Model element because rebar hosting is disabled in the family [Name].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidRebarHostFamilyCanHostRebarParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidRebarHostFamilyCanHostRebarParam As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidRebarHostFamilyCanHostRebarParam {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace